---
kind: property
id: P:Autodesk.Revit.DB.Visual.Gradient.TextureScaleLock
source: html/4a51007f-ddf5-a830-17f1-9a8abcddf0d0.htm
---
# Autodesk.Revit.DB.Visual.Gradient.TextureScaleLock Property

The property labeled "Scale Lock" from the "Gradient" schema.

## Syntax (C#)
```csharp
public static string TextureScaleLock { get; }
```

## Remarks
This property is of type "AssetPropertyBoolean".